package com.practice.controlStatement;

public class For2 {
    public static void main(String[] args) {

        //1. 숫자 1부터 10까지 출력하는 코드를 for문을 이용해서 작성
        //- 출력예시
        //  1
        //  2
        //  3
        // ...
        //  10
        for(int i=1; i<=10; i++) {
            System.out.println(i);
        }


        //2. 구구단 2단을 츨력하는 코드를 for문을 이용해서 작성
        //- 출력예시
        // 2 X 1 = 2
        // 2 X 2 = 4
        // ...
        // 2 X 9 = 18


        //3. 1부터 10까지 짝수를 출력하는 코드를 for문과 if문을 이용해서 작성
        //- 출력예시
        // 1
        // 3
        // 5
        // ...
        // 9


        //4. 5에서 1까지 거꾸로 출력하는 코드를 for문을 이용해서 작성


        //5. 10에서 1까지 홀수를 출력하는 코드를 for문을 이용해서 작성


        //6. 1부터 100까지의 숫자 중 3의 배수만 출력하는 코드를 for문을 이용해서 작성


        //7. 별(*)을 이용해서 삼각형을 출력하는 코드를 for문을 이용해서 작성
        //- 출력예시
        // *
        // **
        // ***
        // ****
        // *****


    }
}
